{"review": [{"text_id": "Hyere82c2m", "sid": 0, "sentence": "Summary: The paper focuses on comparing the impact of explicit modularity and structure on systematic generalization by studying neural modular networks and “generic” models."}, {"text_id": "Hyere82c2m", "sid": 1, "sentence": "The paper studies one instantiation of this systematic generalization for the setting of binary “yes” or “no” visual question answering task."}, {"text_id": "Hyere82c2m", "sid": 2, "sentence": "They introduce a new dataset called in which model has to answer questions that require spatial reasoning about pairs of randomly scattered letters and digits in the image."}, {"text_id": "Hyere82c2m", "sid": 3, "sentence": "While the models are evaluated on all possible object pairs, they are trained on a smaller subset."}, {"text_id": "Hyere82c2m", "sid": 4, "sentence": "They observe that NMNs generalize better than other neural models when an appropriate choice of layout and parametrization is made."}, {"text_id": "Hyere82c2m", "sid": 5, "sentence": "They also show that current end-to-end approaches for inducing model layout or learning model parametrization fail to generalize better than generic models."}, {"text_id": "Hyere82c2m", "sid": 6, "sentence": "Pros:"}, {"text_id": "Hyere82c2m", "sid": 7, "sentence": "- The conclusions of the paper regarding the generalization ability of neural modular networks is timely given the widespread interest in these class of algorithms."}, {"text_id": "Hyere82c2m", "sid": 8, "sentence": "- Additionally, they present interesting observations regarding how sensitive NMNs are to the layout of models."}, {"text_id": "Hyere82c2m", "sid": 9, "sentence": "Experimental evidence (albeit on specific type of question) of this behaviour will be helpful for the community and hopefully motivate them to incorporate regularizers or priors that steer the learning towards better layouts."}, {"text_id": "Hyere82c2m", "sid": 10, "sentence": "- The authors provide a nice summary of all the models analyzed in Section 3.1 and Section 3.2."}, {"text_id": "Hyere82c2m", "sid": 11, "sentence": "Cons:"}, {"text_id": "Hyere82c2m", "sid": 12, "sentence": "- While the results on SQOOP dataset are interesting, it would have been very exciting to see results on other synthetic datasets."}, {"text_id": "Hyere82c2m", "sid": 13, "sentence": "Specifically, there are two datasets which are more complex and uses templated language to generate synthetic datasets similar to this paper:"}, {"text_id": "Hyere82c2m", "sid": 14, "sentence": "- CLEVR environment or a modification of that dataset to reflect the form of systematic the authors are studying in the paper."}, {"text_id": "Hyere82c2m", "sid": 15, "sentence": "- Abstract Scenes VQA dataset introduced in“Yin and Yang: Balancing and Answering Binary Visual Questions” by Zhang and Goyal et al. They provide a balanced dataset in which there are a pairs of scenes for every question, such that the answer to the question is “yes” for one scene, and “no” for the other for the exact same question."}, {"text_id": "Hyere82c2m", "sid": 16, "sentence": "- Perhaps because the authors study a very specific kind of question, they limit their analysis to only three modules and two structures (tree & chain)."}, {"text_id": "Hyere82c2m", "sid": 17, "sentence": "However, in the most general setting NMN will form a DAG and it would have been interesting to see what form of DAGs generalize better than other."}, {"text_id": "Hyere82c2m", "sid": 18, "sentence": "- It is not clear to me how the analysis done in this paper will generalize to other more complex datasets where the network layout NMN might be more complex, the number of modules and type of modules might also be more."}, {"text_id": "Hyere82c2m", "sid": 19, "sentence": "Because, the results are only shown on one dataset, it is harder to see how one might extend this work to other form of questions on slightly harder datasets."}, {"text_id": "Hyere82c2m", "sid": 20, "sentence": "Other Questions / Remarks:"}, {"text_id": "Hyere82c2m", "sid": 21, "sentence": "- Given that the accuracy drop is very significant moving from NMN-Tree to NMN-Chain, is there an explanation for this drop?"}, {"text_id": "Hyere82c2m", "sid": 22, "sentence": "- While the authors mention multiple times that #rhs/#lhs = 1 and 2 are more challenging than #rhs/#lhs=18, they do not sufficiently explain why this is the case anywhere in the paper."}, {"text_id": "Hyere82c2m", "sid": 23, "sentence": "- Small typo in the last line of section 4.3 on page 7. It should say: This is in stark contrast with “NMN-Tree” …"}, {"text_id": "Hyere82c2m", "sid": 24, "sentence": ".."}, {"text_id": "Hyere82c2m", "sid": 25, "sentence": "- Small typo in the “Layout induction” paragraph, line 6 on Page 7:"}, {"text_id": "Hyere82c2m", "sid": 26, "sentence": "…"}, {"text_id": "Hyere82c2m", "sid": 27, "sentence": "and for $p_0(tree) = 0.1$ and when we use the Find module"}], "reviewlabels": [{"text_id": "Hyere82c2m", "sid": 0, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 1, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 2, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 3, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 4, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 5, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 6, "labels": {"coarse": "Structuring", "fine": "Structuring.Heading", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 7, "labels": {"coarse": "Evaluative", "fine": "Evaluative", "asp": "Motivation/Impact", "pol": "P-Positive"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 8, "labels": {"coarse": "Evaluative", "fine": "Evaluative", "asp": "Soundness/Correctness", "pol": "P-Positive"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 9, "labels": {"coarse": "Fact", "fine": "Fact", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 10, "labels": {"coarse": "Evaluative", "fine": "Evaluative", "asp": "Clarity", "pol": "P-Positive"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 11, "labels": {"coarse": "Structuring", "fine": "Structuring.Heading", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 12, "labels": {"coarse": "Request", "fine": "Request.Experiment", "asp": "Meaningful Comparison", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 13, "labels": {"coarse": "Structuring", "fine": "Structuring.Heading", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 14, "labels": {"coarse": "Fact", "fine": "Fact", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 15, "labels": {"coarse": "Fact", "fine": "Fact", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 16, "labels": {"coarse": "Structuring", "fine": "Structuring.Summary", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 17, "labels": {"coarse": "Request", "fine": "Request.Experiment", "asp": "Substance", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 18, "labels": {"coarse": "Request", "fine": "Request.Experiment", "asp": "Substance", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 19, "labels": {"coarse": "Evaluative", "fine": "Evaluative", "asp": "Replicability", "pol": "N-Negative"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 20, "labels": {"coarse": "Structuring", "fine": "Structuring.Heading", "asp": "", "pol": ""}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 21, "labels": {"coarse": "Request", "fine": "Request.Explanation", "asp": "Soundness/Correctness", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 22, "labels": {"coarse": "Request", "fine": "Request.Explanation", "asp": "Soundness/Correctness", "pol": "N-Negative"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 23, "labels": {"coarse": "Request", "fine": "Request.Typo", "asp": "Clarity", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": true}, {"text_id": "Hyere82c2m", "sid": 24, "labels": {"coarse": "Request", "fine": "Request.Typo", "asp": "Clarity", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": true}, {"text_id": "Hyere82c2m", "sid": 25, "labels": {"coarse": "Request", "fine": "Request.Typo", "asp": "Clarity", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": false}, {"text_id": "Hyere82c2m", "sid": 26, "labels": {"coarse": "Request", "fine": "Request.Typo", "asp": "Clarity", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": true}, {"text_id": "Hyere82c2m", "sid": 27, "labels": {"coarse": "Request", "fine": "Request.Typo", "asp": "Clarity", "pol": "U-Neutral"}, "secondarylabels": [], "merge-with-prior": true}], "rebuttal": [{"text_id": "H1xbP6B8TX", "sid": 0, "sentence": "We thank Reviewer 1 (R1) for their review and for asking interesting questions that helped us to understand where our paper may have been unclear."}, {"text_id": "H1xbP6B8TX", "sid": 1, "sentence": "In our response below we will try our best to better explain our motivation for building and using SQOOP, as well as address R1’s other questions and concerns."}, {"text_id": "H1xbP6B8TX", "sid": 2, "sentence": "A key concern that R1 expressed in their review is that we perform our study on the new SQOOP dataset, instead of using an available one (for example CLEVR or Abstract Scenes VQA)."}, {"text_id": "H1xbP6B8TX", "sid": 3, "sentence": "Though we appreciate the concern (it has spurred us to rethink and rephrase how we justify SQOOP) we still believe that the SQOOP dataset is the best choice for precisely testing our ideas."}, {"text_id": "H1xbP6B8TX", "sid": 4, "sentence": "We kindly invite R1 to consider the following arguments in favor of doing so:"}, {"text_id": "H1xbP6B8TX", "sid": 5, "sentence": "The goal of our study was to perform a thorough investigation of systematic generalization of language understanding models."}, {"text_id": "H1xbP6B8TX", "sid": 6, "sentence": "To that end, we wanted a setup that is as simple as possible, while still being challenging by testing the ability to extend the relational reasoning learned to unseen combinations of seen words."}, {"text_id": "H1xbP6B8TX", "sid": 7, "sentence": "We therefore choose to focus on simplest relational questions of the form XRY, as they also allow us to factor out challenges of discrete optimization in choosing the right module layout (required for Stochastic N2NMN)."}, {"text_id": "H1xbP6B8TX", "sid": 8, "sentence": "The simplicity is also useful because most models get to 100% accuracy on the training set of SQOOP, which allowed us to put aside any remaining optimization challenges and just focus our study on systematic generalization."}, {"text_id": "H1xbP6B8TX", "sid": 9, "sentence": "In contrast, we find that the popular CLEVR dataset does not satisfy our requirements and if we did modify it sufficiently, we believe that it would only differ from SQOOP in the actual rendering and would not affect our conclusions."}, {"text_id": "H1xbP6B8TX", "sid": 10, "sentence": "Though visually more complex, CLEVR has only 3 object types: cylinder, sphere and cube."}, {"text_id": "H1xbP6B8TX", "sid": 11, "sentence": "Therefore, it would only allow for 3x4x3=36 different XRY relational questions."}, {"text_id": "H1xbP6B8TX", "sid": 12, "sentence": "This is arguably not enough to sufficiently represent real world situations, and would definitely hinder our experiments."}, {"text_id": "H1xbP6B8TX", "sid": 13, "sentence": "Specifically, we would not be able to sufficiently vary the difficulty of our generalization challenge when allowing 1,2,4,8 or 18 possible right hand-side objects in the questions (we clarify why splits with lower #rhs/lhs are more difficult than those with higher #rhs/lhs later in this response)."}, {"text_id": "H1xbP6B8TX", "sid": 14, "sentence": "Hence, we did not find the original CLEVR readily appropriate for our study."}, {"text_id": "H1xbP6B8TX", "sid": 15, "sentence": "We could, in theory, introduce new object types to CLEVR and rerender a new dataset in 3D using Blender (the renderer that was used to create CLEVR) with different lighting conditions and partial occlusions."}, {"text_id": "H1xbP6B8TX", "sid": 16, "sentence": "Though enticing, we believe that such a 3D version of SQOOP would lead to exactly same conclusions, because the vision required to recognize the objects in the scene would still be rather trivial."}, {"text_id": "H1xbP6B8TX", "sid": 17, "sentence": "The Ying and Yang dataset is clearly a valuable resource (and we thank the reviewer for the pointer), but we do not think it is readily suitable for the kind of study that we aim to perform."}, {"text_id": "H1xbP6B8TX", "sid": 18, "sentence": "The dataset, to the best of our understanding, uses crowd-sourced questions (as the questions are taken from Abstract VQA dataset, whose captions were entered by a human, according to the original VQA paper https://arxiv.org/pdf/1505.00468v6.pdf)."}, {"text_id": "H1xbP6B8TX", "sid": 19, "sentence": "Using crowd-sourced questions would not allow us to control our experiments at the level of precision that we wanted to achieve (e.g. we would not know the ground-truth layouts, it would be harder to construct splits of varying difficulty, etc.)."}, {"text_id": "H1xbP6B8TX", "sid": 20, "sentence": "As well, Abstract VQA contains only 50k scenes, and from our experience with SQOOP we know that this number would be not sufficient to rule out overfitting to training images as a factor."}, {"text_id": "H1xbP6B8TX", "sid": 21, "sentence": "We thank R1 for their constructive suggestion to consider NMNs that form a DAG."}, {"text_id": "H1xbP6B8TX", "sid": 22, "sentence": "We are currently investigating a chain-structured NMN with shortcuts from the output of the stem to each of the modules, and we will soon report these additional results in the upcoming revision of the paper."}, {"text_id": "H1xbP6B8TX", "sid": 23, "sentence": "We hope that these results, combined with further qualitative investigations we are conducting, will answer the legitimate question of R1 as to why Chain-NMN performs so much worse than Tree-NMN."}, {"text_id": "H1xbP6B8TX", "sid": 24, "sentence": "We acknowledge that the text of the paper can be improved to explain better why splits with lower #rhs/lhs are generally harder than those with higher #rhs/lhs, and we thank R1 for pointing this"}, {"text_id": "H1xbP6B8TX", "sid": 25, "sentence": "out"}, {"text_id": "H1xbP6B8TX", "sid": 26, "sentence": "."}, {"text_id": "H1xbP6B8TX", "sid": 27, "sentence": "Our reasoning is that lower #rhs/lhs are harder because the training admits more spurious solutions in them."}, {"text_id": "H1xbP6B8TX", "sid": 28, "sentence": "In such spurious regimes models adapt to the specific lhs-rhs combinations from the training and can not generalize to unseen lhs-rhs combinations (i.e. generalizing from questions about “A” in relation with “B” to “A” in relation to “D” (as in #rhs/lhs=1) is more difficult than generalizing from questions about “A” in relation to “B” and “C” to the same “A” in relation to “D” (as in #rhs/lhs=2)."}, {"text_id": "H1xbP6B8TX", "sid": 29, "sentence": "We will update the paper to be more explicit in explaining these considerations."}, {"text_id": "H1xbP6B8TX", "sid": 30, "sentence": "We would like to conclude our response by replying to the higher-level concern of R1 that the findings of our study may not “generalize to other more complex datasets where the network layout NMN might be more complex, the number of modules and type of modules might also be more”."}, {"text_id": "H1xbP6B8TX", "sid": 31, "sentence": "While we fully agree that more complex datasets with more complex questions would bring new challenges, these are ones we purposely put aside (such as the general unavailability of ground-truth layouts for vanilla NMN, the need to consider an exponentially large set of possible layouts for Stochastic N2NMN, etc.) We believe that it is highly valuable for the research community to know what happens in the simple ideal case of SQOOP, where we can precisely test our specific generalization criterion."}, {"text_id": "H1xbP6B8TX", "sid": 32, "sentence": "This knowledge (e.g. the superiority of trees to chains, the sensitivity of layout induction to initialization, the emergence of spurious parameterization in end-to-end learning), will guide researchers in choosing, designing and troubleshooting their models, as they now know what to expect modulo the optimization challenges that they may face."}, {"text_id": "H1xbP6B8TX", "sid": 33, "sentence": "The field of language understanding with deep learning is not easily amenable to mathematical theoretical investigations and, with that in mind, rigorous minimalistic studies like ours are arguably very important."}, {"text_id": "H1xbP6B8TX", "sid": 34, "sentence": "To some extent, they play the role of the former: they inform researcher intuition and lay a solid foundation for scientific dialogue."}, {"text_id": "H1xbP6B8TX", "sid": 35, "sentence": "We purposely traded breadth for depth in our investigations, and we will go even deeper in the additional experiments that the upcoming revision will contain."}, {"text_id": "H1xbP6B8TX", "sid": 36, "sentence": "We believe that the total of our results makes a complete conference paper."}, {"text_id": "H1xbP6B8TX", "sid": 37, "sentence": "All that said, we would welcome specific suggestions of additional experiments that we could carry out in order to better validate our claims."}, {"text_id": "H1xbP6B8TX", "sid": 38, "sentence": "We hope that this response has clarified to R1 what our paper was insufficiently clear about. A new revision with additional experiments and fixed typos will soon be uploaded to OpenReview, and we hope that R1 takes this response and the changes that we will make to the paper into account."}], "rebuttallabels": [{"labels": {"alignments": [], "responsetype": "social", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 0}, {"labels": {"alignments": [], "responsetype": "social", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 1}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "structuring", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 2}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "reject-request_scope_No", "coarseresponse": "dispute"}, "text_id": "H1xbP6B8TX", "sid": 3}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "structuring", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 4}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 5}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 6}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 7}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 8}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 9}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 10}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 11}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 12}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 13}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "reject-request_scope_No", "coarseresponse": "dispute"}, "text_id": "H1xbP6B8TX", "sid": 14}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 15}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 16}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "reject-request_scope_Yes", "coarseresponse": "dispute"}, "text_id": "H1xbP6B8TX", "sid": 17}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 18}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 19}, {"labels": {"alignments": [12, 13, 14, 15], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 20}, {"labels": {"alignments": [16, 17], "responsetype": "social", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 21}, {"labels": {"alignments": [16, 17], "responsetype": "by-cr_manu_Yes", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 22}, {"labels": {"alignments": [21], "responsetype": "by-cr_manu_Yes", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 23}, {"labels": {"alignments": [22], "responsetype": "concede-criticism", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 24}, {"labels": {"alignments": [22], "responsetype": "concede-criticism", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 25}, {"labels": {"alignments": [22], "responsetype": "concede-criticism", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 26}, {"labels": {"alignments": [22], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 27}, {"labels": {"alignments": [22], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 28}, {"labels": {"alignments": [22], "responsetype": "by-cr_manu_Yes", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 29}, {"labels": {"alignments": [18, 19], "responsetype": "structuring", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 30}, {"labels": {"alignments": [18, 19], "responsetype": "concede-criticism", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 31}, {"labels": {"alignments": [18, 19], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 32}, {"labels": {"alignments": [18, 19], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 33}, {"labels": {"alignments": [18, 19], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 34}, {"labels": {"alignments": [18, 19], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 35}, {"labels": {"alignments": [18, 19], "responsetype": "answer", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 36}, {"labels": {"alignments": [], "responsetype": "social", "coarseresponse": "nonarg"}, "text_id": "H1xbP6B8TX", "sid": 37}, {"labels": {"alignments": [], "responsetype": "by-cr_manu_Yes", "coarseresponse": "concur"}, "text_id": "H1xbP6B8TX", "sid": 38}], "metadata": {"anno": "anno2", "review": "Hyere82c2m", "rebuttal": "H1xbP6B8TX", "conference": "ICLR2019", "title": "Systematic Generalization: What Is Required and Can It Be Learned?", "reviewer": "AnonReviewer1", "forum_id": "HkezXnA9YX", "rating": "6: Marginally above acceptance threshold", "confidence": "3: The reviewer is fairly confident that the evaluation is correct"}}